Feature: Вход в системата

  Scenario: Вход в системата с валидни потребителски данни
    Given Потребителят отваря екрана за вход в системата
    When Потребителят въведе потребителско име "Iliyana"
    And Въведе парола "Iliyana1234"
    And Натисне върху бутона за вход в системата
    Then Вижда съобщение "ОК".
    
  Scenario: Вход в системата с невалидни потребителски данни
    Given Потребителят отваря екрана за вход в системата
    When Потребителят въведе потребителско име "Iliyana11"
    And Въведе парола "12Iliyana1234"
    And Натисне върху бутона за вход в системата
    Then Вижда съобщение "грешни потребителски данни".
    
  Scenario: Вход в системата без парола
    Given Потребителят отваря екрана за вход в системата
    When Потребителят въведе потребителско име "Iliyana11"
    And Натисне върху бутона за вход в системата
    Then Вижда съобщение "Въведете парола".
    
  Scenario: Вход в системата без потребителско име
    Given Потребителят отваря екрана за вход в системата
    When Въведе парола "12Iliyana1234"
    And Натисне върху бутона за вход в системата
    Then Вижда съобщение "Въведете потребителско име".
    
  Scenario: Вход в системата без потребителски данни
    Given Потребителят отваря екрана за вход в системата
    And Натисне върху бутона за вход в системата
    Then Вижда съобщение "Въведете потребителско име и парола".
  
  