Feature: Създаване на поръчка

Scenario: Създаване на поръчка без потребителя да е въвел данните си
    Given Потребителят е в началната страница
    When Натиска бутон за създаване на поръчка
    And Отваря се страница с видове книги
    And Натиска бутон за създаване на поръчка
    Then Появява се съобщение "Въведете всички данни"
    
Scenario: Създаване на поръчка без потребителя да е въвел адрес за доставка
    Given Потребителят е в началната страница
    When Натиска бутон за създаване на поръчка
    And Отваря се страница с видове книги
    And Натиска бутон за завършване на поръчка
    Then Появява се съобщение "Въведете всички данни"
    
Scenario: Създаване на поръчка без потребителя да е въвел номер за връзка
    Given Потребителят е в началната страница
    When Натиска бутон за създаване на поръчка
    And Отваря се страница с видове книги
    And Натиска бутон за завършване на поръчка
    Then Появява се съобщение "Въведете всички данни"
    
Scenario: Създаване на поръчка без потребителя да е избрал артикул
    Given Потребителят е в началната страница
    When Натиска бутон за създаване на поръчка
    And Отваря се страница с видове книги
    And Натиска бутон за завършване на поръчка
    Then Появява се съобщение "Изберете артикул"
    
Scenario: Създаване на поръчка с попълнени всички данни
    Given Потребителят е в началната страница
    When Натиска бутон за създаване на поръчка
    And Отваря се страница с видове книги
    And Натиска бутон за завършване на поръчка
    Then Появява се съобщение "Завършена успешно поръчка"
    
    